Show / Hide Table of Contents
Class CrossSectionCreepCoefficientAttribute
Cross-section creep coefficient attribute
Inheritance
System.Object
OpenObject
OpenAttribute
CrossSectionCreepCoefficientAttribute
Inherited Members
 OpenAttribute.Element
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.CrossSection.ComponentsCreepCoefficientAttribute,CI.CrossSection")]
public class CrossSectionCreepCoefficientAttribute : OpenAttribute
Examples
This sample shows how to create attributes for creep calculation.
//Creating the model
OpenModel openModel = new OpenModel();
//Set creep definition - on component 0, creep and notional size are calculated, humidity 60%
CrossSectionCreepCoefficientAttribute creepAttr = new CrossSectionCreepCoefficientAttribute();
creepAttr.Element = new ReferenceElement(css);
CrossSectionCreepCoefficientData creepComp = new CrossSectionCreepCoefficientData();
creepComp.CreepInput = InputValueType.Calculate;
creepComp.ComponentIndex = new List<int>() { 0 };
creepComp.Humidity = 0.6;
creepComp.NotionalSizeInput = InputValueType.Calculate;
creepAttr.Components.Add(creepComp);
openModel.AddObject(creepAttr);
Constructors
Improve this Doc   View Source
CrossSectionCreepCoefficientAttribute()
Constructor
Declaration
public CrossSectionCreepCoefficientAttribute()
Properties
Improve this Doc   View Source
Components
List of components
Declaration
public List<CrossSectionCreepCoefficientData> Components { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<CrossSectionCreepCoefficientData>
 Improve this Doc
 View Source